# 데이터프레임의 데이터 조작

In [1]:
import numpy as np
import pandas as pd

## 데이터 갯수 세기

In [2]:
s = pd.Series(range(10))
s[3] = np.nan       # nan은 실수(float)!
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [4]:
s.count()       # nan을 제외한 데이터 개수

9

In [6]:
df = pd.DataFrame(np.arange(16).reshape(4,4), dtype=float)
df.iloc[2,3] = np.nan
df

      0     1     2     3
0   0.0   1.0   2.0   3.0
1   4.0   5.0   6.0   7.0
2   8.0   9.0  10.0   NaN
3  12.0  13.0  14.0  15.0

In [8]:
df.count()      # Series별로 데이터 개수 표시

0    4
1    4
2    4
3    3
dtype: int64

In [9]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head()

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

In [10]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [11]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

In [12]:
titanic.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [13]:
anscombe = sns.load_dataset('anscombe')     # 숫자만 보면 안된다. 그래프로 꼭 확인하기 (feat. anscombe’s quartet)
anscombe.head()

  dataset     x     y
0       I  10.0  8.04
1       I   8.0  6.95
2       I  13.0  7.58
3       I   9.0  8.81
4       I  11.0  8.33

## 카테고리 값 세기 ( value_counts() )
- 한꺼번에는 안되고 시리즈별로 세야함

In [14]:
titanic.sex.value_counts()

male      577
female    314
Name: sex, dtype: int64

In [15]:
titanic.embark_town.value_counts()

Southampton    644
Cherbourg      168
Queenstown      77
Name: embark_town, dtype: int64

## 정렬

In [17]:
np.random.seed(2021)
s2 = pd.Series(np.random.randint(6, size = 100))
s2.tail()

95    1
96    1
97    5
98    0
99    5
dtype: int64

In [18]:
s2.value_counts()

5    21
1    21
2    19
3    18
4    13
0     8
dtype: int64

In [19]:
s2.value_counts().sort_values()

0     8
4    13
3    18
2    19
5    21
1    21
dtype: int64

In [21]:
# 내림차순
s2.value_counts().sort_values(ascending=False)

1    21
5    21
2    19
3    18
4    13
0     8
dtype: int64

In [26]:
titanic.sort_values(by='fare', ascending=False).head(7)

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
258         1       1  female  35.0  ...   NaN    Cherbourg    yes   True
737         1       1    male  35.0  ...     B    Cherbourg    yes   True
679         1       1    male  36.0  ...     B    Cherbourg    yes  False
88          1       1  female  23.0  ...     C  Southampton    yes  False
27          0       1    male  19.0  ...     C  Southampton     no  False
341         1       1  female  24.0  ...     C  Southampton    yes  False
438         0       1    male  64.0  ...     C  Southampton     no  False

[7 rows x 15 columns]

In [25]:
titanic.sort_values(by=['fare', 'age']).head(7)         # fare가 첫번째 기준, age가 두번째 기준

     survived  pclass   sex   age  ...  deck  embark_town  alive alone
302         0       3  male  19.0  ...   NaN  Southampton     no  True
271         1       3  male  25.0  ...   NaN  Southampton    yes  True
179         0       3  male  36.0  ...   NaN  Southampton     no  True
822         0       1  male  38.0  ...   NaN  Southampton     no  True
806         0       1  male  39.0  ...     A  Southampton     no  True
263         0       1  male  40.0  ...     B  Southampton     no  True
597         0       3  male  49.0  ...   NaN  Southampton     no  True

[7 rows x 15 columns]

## 행/열 합계

In [27]:
np.random.seed(2021)
df2 = pd.DataFrame(np.random.randint(10, size=(4,8)))
df2

   0  1  2  3  4  5  6  7
0  4  5  9  0  6  5  8  6
1  6  6  6  1  5  7  1  1
2  5  2  0  3  1  0  2  6
3  4  8  5  1  6  7  5  6

In [28]:
df2.sum()

0    19
1    21
2    20
3     5
4    18
5    19
6    16
7    19
dtype: int64

In [29]:
df2.sum(axis=1)

0    43
1    33
2    19
3    42
dtype: int64

In [31]:
df2['RowSum'] = df2.sum(axis=1)
df2

   0  1  2  3  4  5  6  7  RowSum
0  4  5  9  0  6  5  8  6      86
1  6  6  6  1  5  7  1  1      66
2  5  2  0  3  1  0  2  6      38
3  4  8  5  1  6  7  5  6      84

In [32]:
df2.loc['ColSum', :] = df2.sum()
df2

           0     1     2    3     4     5     6     7  RowSum
0        4.0   5.0   9.0  0.0   6.0   5.0   8.0   6.0    86.0
1        6.0   6.0   6.0  1.0   5.0   7.0   1.0   1.0    66.0
2        5.0   2.0   0.0  3.0   1.0   0.0   2.0   6.0    38.0
3        4.0   8.0   5.0  1.0   6.0   7.0   5.0   6.0    84.0
ColSum  19.0  21.0  20.0  5.0  18.0  19.0  16.0  19.0   274.0

### 연습문제 4.4.3

In [40]:
# (1) 타이타닉호 승객의 평균 나이를 구하라.
np.round(titanic.age.mean(),2)

29.7

In [37]:
# (2) 타이타닉호 승객중 여성 승객의 평균 나이를 구하라.
titanic[titanic.sex == 'female'].head()

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
8         1       3  female  27.0  ...   NaN  Southampton    yes  False
9         1       2  female  14.0  ...   NaN    Cherbourg    yes  False

[5 rows x 15 columns]

In [39]:
np.round(titanic[titanic.sex == 'female'].age.mean(), 2)

27.92

In [44]:
# (3)타이타닉호 승객중 1등실 선실의 여성 승객의 평균 나이를 구하라.
titanic[titanic.pclass == 1][titanic.sex == 'female'].head(7)

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: UserWarning: Boolean Series key will be reindexed to match DataFrame index.

    survived  pclass     sex   age  ...  deck  embark_town  alive  alone
1          1       1  female  38.0  ...     C    Cherbourg    yes  False
3          1       1  female  35.0  ...     C  Southampton    yes  False
11         1       1  female  58.0  ...     C  Southampton    yes   True
31         1       1  female   NaN  ...     B    Cherbourg    yes  False
52         1       1  female  49.0  ...     D    Cherbourg    yes  False
61         1       1  female  38.0  ...     B          NaN    yes   True
88         1       1  female  23.0  ...     C  Southampton    yes  False

[7 rows x 15 columns]

In [53]:
import warnings
warnings.filterwarnings('ignore')

In [54]:
np.round(titanic[titanic.pclass == 1][titanic.sex == 'female'].age.mean(), 2)

34.61

## apply 변환
- map과 비슷한 기능

In [55]:
df3 = pd.DataFrame({
    'A': [1, 3, 4, 3, 4],
    'B': [2, 3, 1, 2, 3],
    'C': [1, 5, 2, 4, 4]
})
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [56]:
df3.apply(lambda x: x.max() - x.min())

A    3
B    2
C    4
dtype: int64

In [57]:
df3.apply(lambda x: x.max() - x.min(), axis=1)

0    1
1    2
2    3
3    2
4    1
dtype: int64

In [58]:
titanic['성인'] = titanic.apply(lambda r: '성인' if r.age>=20 else '아이', axis=1)
titanic.tail()

     survived  pclass     sex   age  sibsp  ...  deck  embark_town alive  alone  성인
886         0       2    male  27.0      0  ...   NaN  Southampton    no   True  성인
887         1       1  female  19.0      0  ...     B  Southampton   yes   True  아이
888         0       3  female   NaN      1  ...   NaN  Southampton    no  False  아이
889         1       1    male  26.0      0  ...     C    Cherbourg   yes   True  성인
890         0       3    male  32.0      0  ...   NaN   Queenstown    no   True  성인

[5 rows x 16 columns]

### 연습문제 4.4.4

In [ ]:
# 타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category1 열을 만들어라.
# category1 카테고리는 다음과 같이 정의된다.
# 20살이 넘으면 성별을 그대로 사용한다.
# 20살 미만이면 성별에 관계없이 “child”라고 한다.

In [59]:
titanic['category1'] = titanic.apply(lambda r: r.sex if r.age>=20 else 'child', axis=1)
titanic.tail()

     survived  pclass     sex   age  ...  alive  alone  성인 category1
886         0       2    male  27.0  ...     no   True  성인      male
887         1       1  female  19.0  ...    yes   True  아이     child
888         0       3  female   NaN  ...     no  False  아이     child
889         1       1    male  26.0  ...    yes   True  성인      male
890         0       3    male  32.0  ...     no   True  성인      male

[5 rows x 17 columns]

## fillna() method
- nan 값이 너무 많으면 열 버리기
- 적으면 평균이나 메디안이나 최빈값으로 대체

In [60]:
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [62]:
df3.apply(pd.value_counts)

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [66]:
df3.apply(pd.value_counts).fillna(0.0)

     A    B    C
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

### 연습문제 4.4.5

In [71]:
titanic.age.fillna(titanic.age.mean(), inplace=True)        # inplace가 False면 한번 보여주고 끝, 안고쳐짐
titanic.tail()

     survived  pclass     sex        age  ...  alive  alone  성인 category1
886         0       2    male  27.000000  ...     no   True  성인      male
887         1       1  female  19.000000  ...    yes   True  아이     child
888         0       3  female  29.699118  ...     no  False  아이     child
889         1       1    male  26.000000  ...    yes   True  성인      male
890         0       3    male  32.000000  ...     no   True  성인      male

[5 rows x 17 columns]

## astype() method

In [72]:
df3.apply(pd.value_counts).fillna(0.0)

     A    B    C
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [73]:
df3.apply(pd.value_counts).fillna(0.0).astype(int)

   A  B  C
1  1  1  1
2  0  2  1
3  2  2  0
4  2  0  2
5  0  0  1

## 실수 값을 카테고리 값으로 변환

In [74]:
ages = [0, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 101]

In [76]:
bins = [1, 20, 30, 50, 70, 100]
labels = ['미성년자', '청년', '중년', '장년', '노년']
cats = pd.cut(ages, bins, labels=labels)
cats

[NaN, '미성년자', '미성년자', '청년', '청년', ..., '장년', '미성년자', '중년', '중년', NaN]
Length: 12
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

In [77]:
cats.codes

array([-1,  0,  0,  1,  1,  2,  2,  3,  0,  2,  2, -1], dtype=int8)

In [78]:
np.random.seed(2021)
data = np.random.randn(1000)
cats = pd.qcut(data, 4, labels=['Q1', 'Q2', 'Q3', 'Q4'])
cats

['Q4', 'Q3', 'Q2', 'Q1', 'Q3', ..., 'Q3', 'Q1', 'Q4', 'Q2', 'Q2']
Length: 1000
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [79]:
pd.value_counts(cats)

Q4    250
Q3    250
Q2    250
Q1    250
dtype: int64